cb=\u8BA1\u7B97\u673A\u57FA\u7840\u662F\u5165\u95E8\u8BA1\u7B97\u673A\u5F00\u53D1\u9886\u57DF\u6240\u5FC5\u987B\u8981\u638C\u63E1\u7684\u57FA\u7840\u77E5\u8BC6\uFF0C\u4E3B\u8981\u5305\u62EC\u6570\u636E\u7ED3\u6784\u4E0E\u7B97\u6CD5\u3001\u64CD\u4F5C\u7CFB\u7EDF\u3001\u8BA1\u7B97\u673A\u7F51\u7EDC\u3001\u8BA1\u7B97\u673A\u7EC4\u6210\u539F\u7406\u3001\u8BBE\u8BA1\u6A21\u5F0F\u3001\u8F6F\u4EF6\u5DE5\u7A0B\u7B49
algorithm=\u6570\u636E\u7ED3\u6784\u662F\u6307\u76F8\u4E92\u4E4B\u95F4\u5B58\u5728\u4E00\u79CD\u6216\u591A\u79CD\u7279\u5B9A\u5173\u7CFB\u7684\u6570\u636E\u5143\u7D20\u7684\u96C6\u5408\u7528\u8BA1\u7B97\u673A\u5B58\u50A8\u3001\u7EC4\u7EC7\u6570\u636E\u7684\u65B9\u5F0F\u3002
network=\u8BA1\u7B97\u673A\u7F51\u7EDC\u662F\u6307\u5C06\u5730\u7406\u4F4D\u7F6E\u4E0D\u540C\u7684\u5177\u6709\u72EC\u7ACB\u529F\u80FD\u7684\u591A\u53F0\u8BA1\u7B97\u673A\u53CA\u5176\u5916\u90E8\u8BBE\u5907\uFF0C\u901A\u8FC7\u901A\u4FE1\u7EBF\u8DEF\u8FDE\u63A5\u8D77\u6765\uFF0C\u5728\u7F51\u7EDC\u64CD\u4F5C\u7CFB\u7EDF\uFF0C\u7F51\u7EDC\u7BA1\u7406\u8F6F\u4EF6\u53CA\u7F51\u7EDC\u901A\u4FE1\u534F\u8BAE\u7684\u7BA1\u7406\u548C\u534F\u8C03\u4E0B\uFF0C\u5B9E\u73B0\u8D44\u6E90\u5171\u4EAB\u548C\u4FE1\u606F\u4F20\u9012\u7684\u8BA1\u7B97\u673A\u7CFB\u7EDF\u3002
os=\u64CD\u4F5C\u7CFB\u7EDF(Operating System\uFF0C\u7B80\u79F0OS)\u662F\u7BA1\u7406\u8BA1\u7B97\u673A\u8F6F\u4EF6\u548C\u786C\u4EF6\u8D44\u6E90\u7684\u7A0B\u5E8F\uFF0C\u662F\u8BA1\u7B97\u673A\u7CFB\u7EDF\u7684\u5185\u6838\u548C\u57FA\u77F3\u3002\u5B83\u7684\u672C\u8D28\u662F\u8FD0\u884C\u5728\u8BA1\u7B97\u673A\u4E0A\u7684\u8F6F\u4EF6\uFF0C\u4E3A\u7528\u6237\u63D0\u4F9B\u4E86\u4E00\u4E2A\u548C\u7CFB\u7EDF\u4EA4\u4E92\u7684\u64CD\u4F5C\u9875\u9762\u3002
dp=\u8BBE\u8BA1\u6A21\u5F0F\uFF08Design Pattern\uFF09\u662F\u4E00\u5957\u88AB\u53CD\u590D\u4F7F\u7528\u3001\u591A\u6570\u4EBA\u77E5\u6653\u7684\u3001\u7ECF\u8FC7\u5206\u7C7B\u7684\u3001\u4EE3\u7801\u8BBE\u8BA1\u7ECF\u9A8C\u7684\u603B\u7ED3\u3002\u4F7F\u7528\u8BBE\u8BA1\u6A21\u5F0F\u7684\u76EE\u7684\uFF1A\u4E3A\u4E86\u4EE3\u7801\u53EF\u91CD\u7528\u6027\u3001\u8BA9\u4EE3\u7801\u66F4\u5BB9\u6613\u88AB\u4ED6\u4EBA\u7406\u89E3\u3001\u4FDD\u8BC1\u4EE3\u7801\u53EF\u9760\u6027\u3002
se=\u8F6F\u4EF6\u5DE5\u7A0B (Software Engineering\uFF0C\u7B80\u79F0\u4E3ASE)\u662F\u4E00\u95E8\u7814\u7A76\u7528\u5DE5\u7A0B\u5316\u65B9\u6CD5\u6784\u5EFA\u548C\u7EF4\u62A4\u6709\u6548\u7684\u3001\u5B9E\u7528\u7684\u548C\u9AD8\u8D28\u91CF\u7684\u8F6F\u4EF6\u7684\u5B66\u79D1\u3002\u5B83\u6D89\u53CA\u5230\u7A0B\u5E8F\u8BBE\u8BA1\u8BED\u8A00\uFF0C\u6570\u636E\u5E93\uFF0C\u8F6F\u4EF6\u5F00\u53D1\u5DE5\u5177\uFF0C\u7CFB\u7EDF\u5E73\u53F0\uFF0C\u6807\u51C6\uFF0C\u8BBE\u8BA1\u6A21\u5F0F\u7B49\u65B9\u9762\u3002
java=Java\u5177\u6709\u7B80\u5355\u6027\u3001\u9762\u5411\u5BF9\u8C61\u3001\u5206\u5E03\u5F0F\u3001\u5065\u58EE\u6027\u3001\u5B89\u5168\u6027\u3001\u5E73\u53F0\u72EC\u7ACB\u4E0E\u53EF\u79FB\u690D\u6027\u3001\u591A\u7EBF\u7A0B\u3001\u52A8\u6001\u6027\u7B49\u7279\u70B9\u3002Java\u53EF\u4EE5\u7F16\u5199\u684C\u9762\u5E94\u7528\u7A0B\u5E8F\u3001Web\u5E94\u7528\u7A0B\u5E8F\u3001\u5206\u5E03\u5F0F\u7CFB\u7EDF\u548C\u5D4C\u5165\u5F0F\u7CFB\u7EDF\u5E94\u7528\u7A0B\u5E8F\u7B49\uFF0C\u662F\u76EE\u524D\u4F01\u4E1A\u7EA7\u5E94\u7528\u7684\u4E3B\u529B\u7F16\u7A0B\u8BED\u8A00\u3002
framework=\u6846\u67B6( Framework )\u662F\u6784\u6210\u4E00\u7C7B\u7279\u5B9A\u8F6F\u4EF6\u53EF\u590D\u7528\u8BBE\u8BA1\u7684\u4E00\u7EC4\u76F8\u4E92\u534F\u4F5C\u7684\u7C7B\u3002\u6846\u67B6\u89C4\u5B9A\u4E86\u4F60\u7684\u5E94\u7528\u7684\u4F53\u7CFB\u7ED3\u6784\u3002\u5B83\u5B9A\u4E49\u4E86\u6574\u4F53\u7ED3\u6784\uFF0C\u7C7B\u548C\u5BF9\u8C61\u7684\u5206\u5272\uFF0C\u5404\u90E8\u5206\u7684\u4E3B\u8981\u8D23\u4EFB\uFF0C\u7C7B\u548C\u5BF9\u8C61\u600E\u4E48\u534F\u4F5C\uFF0C\u4EE5\u53CA\u63A7\u5236\u6D41\u7A0B\u3002
spring=Spring\u662F\u4E00\u4E2A\u8F7B\u91CF\u7EA7\u7684IOC(Inversion of Control\uFF0C\u63A7\u5236\u53CD\u8F6C)\u548CAOP(Aspect Oriented Programming\uFF0C\u9762\u5411\u5207\u9762\u7F16\u7A0B)\u5F00\u6E90\u6846\u67B6\u3002Spring\u63D0\u5021\u63D0\u5021\u4EE5\u201C\u6700\u5C11\u4FB5\u5165\u201D\u7684\u65B9\u5F0F\u6765\u7BA1\u7406\u5E94\u7528\u4E2D\u7684\u4EE3\u7801\uFF0C\u5E76\u4E14\u5B83\u51FA\u73B0\u7684\u4F7F\u547D\u5C31\u662F\u7B80\u5316Java\u5F00\u53D1\u6D41\u7A0B\u3002
springmvc=Spring MVC\u5C5E\u4E8ESpringFrameWork\u7684\u540E\u7EED\u4EA7\u54C1\uFF0C\u5DF2\u7ECF\u878D\u5408\u5728Spring Web Flow\u91CC\u9762\u3002Spring \u6846\u67B6\u63D0\u4F9B\u4E86\u6784\u5EFA Web \u5E94\u7528\u7A0B\u5E8F\u7684\u5168\u529F\u80FDMVC\u67B6\u6784\u6A21\u5757\u2014\u2014Spring MVC
springboot=Spring Boot\u662F\u7531Pivotal\u56E2\u961F\u63D0\u4F9B\u7684\u5168\u65B0\u6846\u67B6\uFF0C\u5176\u8BBE\u8BA1\u76EE\u7684\u662F\u7528\u6765\u7B80\u5316\u65B0Spring\u5E94\u7528\u7684\u521D\u59CB\u642D\u5EFA\u4EE5\u53CA\u5F00\u53D1\u8FC7\u7A0B\u3002\u8BE5\u6846\u67B6\u4F7F\u7528\u4E86\u7279\u5B9A\u7684\u65B9\u5F0F\u6765\u8FDB\u884C\u914D\u7F6E\uFF0C\u4ECE\u800C\u4F7F\u5F00\u53D1\u4EBA\u5458\u4E0D\u518D\u9700\u8981\u5B9A\u4E49\u6837\u677F\u5316\u7684\u914D\u7F6E\u3002\u901A\u8FC7\u8FD9\u79CD\u65B9\u5F0F\uFF0CSpring Boot\u81F4\u529B\u4E8E\u5728\u84EC\u52C3\u53D1\u5C55\u7684\u5FEB\u901F\u5E94\u7528\u5F00\u53D1\u9886\u57DF(rapid application development)\u6210\u4E3A\u9886\u5BFC\u8005\u3002
mybatis=MyBatis\u662F\u4E00\u6B3E\u4F18\u79C0\u7684\u6301\u4E45\u5C42\u6846\u67B6\uFF0C\u5B83\u652F\u6301\u5B9A\u5236\u5316 SQL\u3001\u5B58\u50A8\u8FC7\u7A0B\u4EE5\u53CA\u9AD8\u7EA7\u6620\u5C04\u3002MyBatis \u907F\u514D\u4E86\u51E0\u4E4E\u6240\u6709\u7684 JDBC \u4EE3\u7801\u548C\u624B\u52A8\u8BBE\u7F6E\u53C2\u6570\u4EE5\u53CA\u83B7\u53D6\u7ED3\u679C\u96C6\u3002MyBatis \u53EF\u4EE5\u4F7F\u7528\u7B80\u5355\u7684 XML \u6216\u6CE8\u89E3\u6765\u914D\u7F6E\u548C\u6620\u5C04\u539F\u751F\u4FE1\u606F\uFF0C\u5C06\u63A5\u53E3\u548C Java \u7684 POJOs(Plain Ordinary Java Object,\u666E\u901A\u7684 Java\u5BF9\u8C61)\u6620\u5C04\u6210\u6570\u636E\u5E93\u4E2D\u7684\u8BB0\u5F55\u3002
redis=Redis\u662F\u4E00\u4E2A\u9AD8\u6027\u80FD\u7684key-value\u5185\u5B58\u6570\u636E\u5E93\u3002Redis\u7684\u51FA\u73B0\uFF0C\u5F88\u5927\u7A0B\u5EA6\u8865\u507F\u4E86memcached\u8FD9\u7C7Bkey/value\u5B58\u50A8\u7684\u4E0D\u8DB3\uFF0C\u76F8\u6BD4\u4E4B\u4E0BRedis\u5177\u6709\u66F4\u4E30\u5BCC\u7684\u6570\u636E\u7C7B\u578B\u3001\u652F\u6301\u6301\u4E45\u5316\u4EE5\u53CARedis\u5929\u751F\u652F\u6301\u9AD8\u53EF\u7528\uFF0C\u56E0\u6B64Redis\u5DF2\u7ECF\u6210\u4E3A\u4E86\u73B0\u4EE3\u4F01\u4E1A\u5E38\u7528\u7684NoSQL\u4E2D\u95F4\u4EF6\u3002
nginx=Nginx (engine x) \u662F\u4E00\u4E2A\u9AD8\u6027\u80FD\u7684HTTP\u548C\u53CD\u5411\u4EE3\u7406web\u670D\u52A1\u5668\uFF0C\u540C\u65F6\u4E5F\u63D0\u4F9B\u4E86IMAP/POP3/SMTP\u670D\u52A1\u3002\u5176\u7279\u70B9\u662F\u5360\u6709\u5185\u5B58\u5C11\uFF0C\u5E76\u53D1\u80FD\u529B\u5F3A\uFF0C\u5728\u8FDE\u63A5\u9AD8\u5E76\u53D1\u7684\u60C5\u51B5\u4E0B\uFF0CNginx\u662FApache\u670D\u52A1\u4E0D\u9519\u7684\u66FF\u4EE3\u54C1\u3002
netty=Netty\u662F\u7531JBOSS\u63D0\u4F9B\u7684\u4E00\u4E2Ajava\u5F00\u6E90\u6846\u67B6\uFF0C\u63D0\u4F9B\u5F02\u6B65\u7684\u3001\u4E8B\u4EF6\u9A71\u52A8\u7684\u7F51\u7EDC\u5E94\u7528\u7A0B\u5E8F\u6846\u67B6\u548C\u5DE5\u5177\uFF0C\u7528\u4EE5\u5FEB\u901F\u5F00\u53D1\u9AD8\u6027\u80FD\u3001\u9AD8\u53EF\u9760\u6027\u7684\u7F51\u7EDC\u670D\u52A1\u5668\u548C\u5BA2\u6237\u7AEF\u7A0B\u5E8F\u3002\u4F8B\u5982\u5B9E\u73B0\u4E86\u67D0\u79CD\u534F\u8BAE\u7684\u5BA2\u6237\u3001\u670D\u52A1\u7AEF\u5E94\u7528\u3002Netty\u76F8\u5F53\u4E8E\u7B80\u5316\u548C\u6D41\u7EBF\u5316\u4E86\u7F51\u7EDC\u5E94\u7528\u7684\u7F16\u7A0B\u5F00\u53D1\u8FC7\u7A0B\uFF0C\u4F8B\u5982\uFF1A\u57FA\u4E8ETCP\u548CUDP\u7684socket\u670D\u52A1\u5F00\u53D1\u3002
docker=Docker \u662F\u4E00\u4E2A\u5F00\u6E90\u7684\u5E94\u7528\u5BB9\u5668\u5F15\u64CE\uFF0C\u8BA9\u5F00\u53D1\u8005\u53EF\u4EE5\u6253\u5305\u4ED6\u4EEC\u7684\u5E94\u7528\u4EE5\u53CA\u4F9D\u8D56\u5305\u5230\u4E00\u4E2A\u53EF\u79FB\u690D\u7684\u5BB9\u5668\u4E2D,\u7136\u540E\u53D1\u5E03\u5230\u4EFB\u4F55\u6D41\u884C\u7684Linux\u673A\u5668\u6216Windows \u673A\u5668\u4E0A,\u4E5F\u53EF\u4EE5\u5B9E\u73B0\u865A\u62DF\u5316,\u5BB9\u5668\u662F\u5B8C\u5168\u4F7F\u7528\u6C99\u7BB1\u673A\u5236,\u76F8\u4E92\u4E4B\u95F4\u4E0D\u4F1A\u6709\u4EFB\u4F55\u63A5\u53E3\u3002
db=\u6570\u636E\u5E93\u662F\u201C\u6309\u7167\u6570\u636E\u7ED3\u6784\u6765\u7EC4\u7EC7\u3001\u5B58\u50A8\u548C\u7BA1\u7406\u6570\u636E\u7684\u4ED3\u5E93\u201D\u3002\u662F\u4E00\u4E2A\u957F\u671F\u5B58\u50A8\u5728\u8BA1\u7B97\u673A\u5185\u7684\u3001\u6709\u7EC4\u7EC7\u7684\u3001\u53EF\u5171\u4EAB\u7684\u3001\u7EDF\u4E00\u7BA1\u7406\u7684\u5927\u91CF\u6570\u636E\u7684\u96C6\u5408\u3002
bigdata=\u4E91\u8BA1\u7B97\uFF08cloud computing\uFF09\u662F\u5206\u5E03\u5F0F\u8BA1\u7B97\u7684\u4E00\u79CD\uFF0C\u6307\u7684\u662F\u901A\u8FC7\u7F51\u7EDC\u201C\u4E91\u201D\u5C06\u5DE8\u5927\u7684\u6570\u636E\u8BA1\u7B97\u5904\u7406\u7A0B\u5E8F\u5206\u89E3\u6210\u65E0\u6570\u4E2A\u5C0F\u7A0B\u5E8F\uFF0C\u7136\u540E\uFF0C\u901A\u8FC7\u591A\u90E8\u670D\u52A1\u5668\u7EC4\u6210\u7684\u7CFB\u7EDF\u8FDB\u884C\u5904\u7406\u548C\u5206\u6790\u8FD9\u4E9B\u5C0F\u7A0B\u5E8F\u5F97\u5230\u7ED3\u679C\u5E76\u8FD4\u56DE\u7ED9\u7528\u6237\u3002
others=\u6280\u672F\u6742\u8C08\u3001\u884C\u4E1A\u65B0\u95FB/\u52A8\u6001....